// Language: javascript
// javascript version of search_algorithm.py

function search(selected_dict){
    // selected_dict = translation_4_search(selected_dict);

    var a=1
    const distance_score_type = {
        'top_direction': 3, 
        'braid_tf': 10, 
        'braid_type': 3, 
        'braid_position': 2}
        
    const distance_score_linear = {
        'top_curly': 1, 
        'top_length': 1.5, 
        'side_curly': 2, 
        'side_length': 2, 
        'braid_count': 8, 
        }

    const mapper = {
        "Top and front side":"top",
        "Side":'side',
        "Braid":'braid',
        "Length":'length',
        "Curl Level":"curly",
        "Direction":'direction',
        "Yes/No Braid":'tf',
        "Count":'count',
        "Position":'position',
        "Braid Style":'type'
    }

    const asset_label = {
        "2995.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "1-斜下": 1,
                "7-向后梳头（长发向后梳，大背头，马尾）": 2,
                "2-横向": 1,
                "4-中分": 7
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 2,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 7
            },
            "side_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 2,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "4-侧边中长发：刚好到肩膀": 4,
                "5-长发：披肩或者有头发耷在肩膀上": 3
            },
            "braid_tf": {
                "1-是": 7,
                "0-否": 2
            },
            "braid_type": {
                "0-没有辫子": 2,
                "1-马尾": 6,
                "3-脏辫": 1
            },
            "braid_count": {
                "0-没有辫子": 2,
                "1-单个辫子": 7
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 1,
                "2-低辫子": 7,
                "0-没有辫子": 3
            }
        },
        "2942.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 3,
                "1-有波纹": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "1-斜下": 3,
                "0-向下": 1,
                "4-中分": 8,
                "5-37分": 1
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 3,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 6
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 5,
                "3-侧边中长发：遮住耳朵": 4
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "8738.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "top_direction": {
                "0-向下": 9
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 3,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 6
            },
            "side_curly": {
                "1-有波纹": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 3,
                "5-长发：披肩或者有头发耷在肩膀上": 6
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1708.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "top_direction": {
                "2-横向": 1,
                "1-斜下": 3,
                "0-向下": 2,
                "5-37分": 4
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 3,
                "3-侧边中长发：遮住耳朵": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 4,
                "1-侧边短发": 1
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "8704.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "top_direction": {
                "1-斜下": 4,
                "0-向下": 1,
                "5-37分": 7
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 7,
                "3-侧边中长发：遮住耳朵": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 1
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1720.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 4
            },
            "top_direction": {
                "6-向上（头发立起来）": 8,
                "0-向下": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "2-头顶板寸": 1,
                "3-头顶短发": 7
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "0-侧边板寸（铲青，能看到头皮）": 1,
                "1-侧边短发": 7
            },
            "braid_tf": {
                "1-是": 1,
                "0-否": 8
            },
            "braid_type": {
                "0-没有辫子": 8,
                "3-脏辫": 1
            },
            "braid_count": {
                "0-没有辫子": 8,
                "3-多个辫子": 1
            },
            "braid_position": {
                "0-没有辫子": 8,
                "1-高辫子（如高马尾）": 1
            }
        },
        "8710.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 4
            },
            "top_direction": {
                "1-斜下": 3,
                "0-向下": 1,
                "4-中分": 8
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 4,
                "5-长发：披肩或者有头发耷在肩膀上": 5
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3057.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "top_direction": {
                "1-斜下": 2,
                "0-向下": 1,
                "2-横向": 1,
                "4-中分": 7
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "3-脏辫": 5,
                "4-丸子（一个或者多个）": 4
            },
            "braid_count": {
                "2-两个辫子": 4,
                "3-多个辫子": 5
            },
            "braid_position": {
                "2-低辫子": 3,
                "1-高辫子（如高马尾）": 7,
                "0-没有辫子": 1
            }
        },
        "1697.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 4,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "top_direction": {
                "6-向上（头发立起来）": 6,
                "0-向下": 2,
                "2-横向": 1
            },
            "top_length": {
                "2-头顶板寸": 6,
                "3-头顶短发": 3
            },
            "side_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 2,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "0-侧边板寸（铲青，能看到头皮）": 5,
                "1-侧边短发": 4
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3080.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "0-向下": 6,
                "1-斜下": 2,
                "4-中分": 3
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 8
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "3-侧边中长发：遮住耳朵": 8
            },
            "braid_tf": {
                "1-是": 5,
                "0-否": 4
            },
            "braid_type": {
                "0-没有辫子": 4,
                "3-脏辫": 5
            },
            "braid_count": {
                "0-没有辫子": 4,
                "3-多个辫子": 5
            },
            "braid_position": {
                "2-低辫子": 3,
                "0-没有辫子": 4,
                "1-高辫子（如高马尾）": 2
            }
        },
        "1683.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 7
            },
            "top_direction": {
                "6-向上（头发立起来）": 2,
                "7-向后梳头（长发向后梳，大背头，马尾）": 7
            },
            "top_length": {
                "3-头顶短发": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 8
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 8,
                "4-侧边中长发：刚好到肩膀": 1
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "1-马尾": 9
            },
            "braid_count": {
                "1-单个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "1318.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "top_direction": {
                "2-横向": 1,
                "1-斜下": 5,
                "5-37分": 5
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 5,
                "3-头顶短发": 2,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 2
            },
            "side_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 4
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 5,
                "3-侧边中长发：遮住耳朵": 3,
                "1-侧边短发": 1
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1330.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "top_direction": {
                "1-斜下": 4,
                "2-横向": 1,
                "0-向下": 3,
                "5-37分": 2
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 3,
                "3-头顶短发": 6
            },
            "side_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "0-侧边板寸（铲青，能看到头皮）": 1,
                "1-侧边短发": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1324.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 6
            },
            "top_direction": {
                "0-向下": 2,
                "1-斜下": 3,
                "7-向后梳头（长发向后梳，大背头，马尾）": 1,
                "5-37分": 6
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 2,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 7
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "1-是": 5,
                "0-否": 4
            },
            "braid_type": {
                "0-没有辫子": 4,
                "3-脏辫": 5
            },
            "braid_count": {
                "0-没有辫子": 4,
                "3-多个辫子": 5
            },
            "braid_position": {
                "2-低辫子": 3,
                "0-没有辫子": 4,
                "1-高辫子（如高马尾）": 2
            }
        },
        "1325.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 4
            },
            "top_direction": {
                "6-向上（头发立起来）": 2,
                "1-斜下": 1,
                "7-向后梳头（长发向后梳，大背头，马尾）": 4,
                "0-向下": 2
            },
            "top_length": {
                "3-头顶短发": 2,
                "4-头顶中等长度（够不到眉毛）": 2,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 5
            },
            "side_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 7
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "3-侧边中长发：遮住耳朵": 5,
                "5-长发：披肩或者有头发耷在肩膀上": 1,
                "4-侧边中长发：刚好到肩膀": 1
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "1-马尾": 5,
                "4-丸子（一个或者多个）": 4
            },
            "braid_count": {
                "1-单个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "1331.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "1-斜下": 5,
                "0-向下": 2,
                "5-37分": 5,
                "4-中分": 2
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1319.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 3,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "0-向下": 8,
                "1-斜下": 1,
                "4-中分": 3
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "1-有波纹": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 4
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1682.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "top_direction": {
                "6-向上（头发立起来）": 1,
                "7-向后梳头（长发向后梳，大背头，马尾）": 5,
                "4-中分": 5
            },
            "top_length": {
                "3-头顶短发": 2,
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 6
            },
            "side_curly": {
                "1-有波纹": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 4,
                "3-侧边中长发：遮住耳朵": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 3,
                "4-侧边中长发：刚好到肩膀": 1
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "3-脏辫": 1,
                "4-丸子（一个或者多个）": 7,
                "2-麻花": 1
            },
            "braid_count": {
                "2-两个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 8,
                "2-低辫子": 1
            }
        },
        "3081.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 5
            },
            "top_direction": {
                "0-向下": 7,
                "1-斜下": 2,
                "4-中分": 2
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 8,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 4,
                "3-侧边中长发：遮住耳朵": 5
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1696.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 8
            },
            "top_direction": {
                "6-向上（头发立起来）": 9,
                "2-横向": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 7,
                "3-头顶短发": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 1
            },
            "side_curly": {
                "0-不卷曲": 5,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 4
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "1-侧边短发": 5,
                "0-侧边板寸（铲青，能看到头皮）": 3
            },
            "braid_tf": {
                "1-是": 5,
                "0-否": 4
            },
            "braid_type": {
                "0-没有辫子": 4,
                "3-脏辫": 5
            },
            "braid_count": {
                "0-没有辫子": 4,
                "3-多个辫子": 5
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 4,
                "0-没有辫子": 4,
                "2-低辫子": 1
            }
        },
        "3056.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "top_direction": {
                "7-向后梳头（长发向后梳，大背头，马尾）": 6,
                "0-向下": 4,
                "1-斜下": 3,
                "2-横向": 1
            },
            "top_length": {
                "3-头顶短发": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 5,
                "3-侧边中长发：遮住耳朵": 2,
                "5-长发：披肩或者有头发耷在肩膀上": 2
            },
            "braid_tf": {
                "1-是": 8,
                "0-否": 1
            },
            "braid_type": {
                "0-没有辫子": 1,
                "3-脏辫": 8
            },
            "braid_count": {
                "0-没有辫子": 1,
                "3-多个辫子": 8
            },
            "braid_position": {
                "2-低辫子": 3,
                "1-高辫子（如高马尾）": 6,
                "0-没有辫子": 1
            }
        },
        "1655.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 4
            },
            "top_direction": {
                "7-向后梳头（长发向后梳，大背头，马尾）": 4,
                "6-向上（头发立起来）": 5,
                "3-斜上": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "2-头顶板寸": 1,
                "3-头顶短发": 6,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 1
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "0-侧边板寸（铲青，能看到头皮）": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1669.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "top_direction": {
                "1-斜下": 1,
                "0-向下": 2,
                "2-横向": 1,
                "5-37分": 9
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 3,
                "1-有波纹": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2599.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 4
            },
            "top_direction": {
                "0-向下": 8,
                "1-斜下": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 8,
                "3-头顶短发": 1
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 3,
                "1-侧边短发": 6
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1721.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "top_direction": {
                "6-向上（头发立起来）": 9
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 3,
                "3-头顶短发": 6
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "0-侧边板寸（铲青，能看到头皮）": 4,
                "1-侧边短发": 5
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1709.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 8
            },
            "top_direction": {
                "6-向上（头发立起来）": 4,
                "0-向下": 3,
                "1-斜下": 2,
                "5-37分": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 5,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 4
            },
            "side_curly": {
                "0-不卷曲": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 8
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "4-侧边中长发：刚好到肩膀": 1,
                "3-侧边中长发：遮住耳朵": 6
            },
            "braid_tf": {
                "1-是": 5,
                "0-否": 4
            },
            "braid_type": {
                "0-没有辫子": 4,
                "3-脏辫": 5
            },
            "braid_count": {
                "0-没有辫子": 4,
                "3-多个辫子": 5
            },
            "braid_position": {
                "2-低辫子": 3,
                "1-高辫子（如高马尾）": 3,
                "0-没有辫子": 4
            }
        },
        "2994.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 4
            },
            "top_direction": {
                "6-向上（头发立起来）": 2,
                "3-斜上": 2,
                "7-向后梳头（长发向后梳，大背头，马尾）": 5,
                "1-斜下": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "3-头顶短发": 7,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 1
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "1-侧边短发": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2996.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "top_direction": {
                "1-斜下": 3,
                "0-向下": 1,
                "4-中分": 9
            },
            "top_length": {
                "3-头顶短发": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 6,
                "5-长发：披肩或者有头发耷在肩膀上": 3
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3108.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 3,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "0-向下": 3,
                "1-斜下": 3,
                "4-中分": 9
            },
            "top_length": {
                "3-头顶短发": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "8713.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "top_direction": {
                "0-向下": 3,
                "1-斜下": 2,
                "7-向后梳头（长发向后梳，大背头，马尾）": 2,
                "4-中分": 7
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "1-是": 7,
                "0-否": 2
            },
            "braid_type": {
                "0-没有辫子": 2,
                "3-脏辫": 7
            },
            "braid_count": {
                "0-没有辫子": 2,
                "3-多个辫子": 7
            },
            "braid_position": {
                "2-低辫子": 3,
                "1-高辫子（如高马尾）": 4,
                "0-没有辫子": 3
            }
        },
        "1723.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 4
            },
            "top_direction": {
                "3-斜上": 4,
                "7-向后梳头（长发向后梳，大背头，马尾）": 5,
                "2-横向": 1,
                "6-向上（头发立起来）": 1,
                "1-斜下": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 3,
                "3-头顶短发": 5,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 1
            },
            "side_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "0-侧边板寸（铲青，能看到头皮）": 1,
                "1-侧边短发": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3068.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "top_direction": {
                "0-向下": 2,
                "1-斜下": 2,
                "4-中分": 9
            },
            "top_length": {
                "3-头顶短发": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "1-有波纹": 2,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "1-是": 1,
                "0-否": 8
            },
            "braid_type": {
                "0-没有辫子": 8,
                "3-脏辫": 1
            },
            "braid_count": {
                "0-没有辫子": 8,
                "3-多个辫子": 1
            },
            "braid_position": {
                "0-没有辫子": 8,
                "1-高辫子（如高马尾）": 1
            }
        },
        "8707.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 3,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "0-向下": 2,
                "1-斜下": 1,
                "2-横向": 1,
                "4-中分": 9
            },
            "top_length": {
                "3-头顶短发": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3054.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "0-向下": 3,
                "1-斜下": 3,
                "4-中分": 8
            },
            "top_length": {
                "3-头顶短发": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 4,
                "4-侧边中长发：刚好到肩膀": 5
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3040.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 8
            },
            "top_direction": {
                "2-横向": 1,
                "1-斜下": 7,
                "0-向下": 1,
                "5-37分": 7
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 8
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 5,
                "4-侧边中长发：刚好到肩膀": 4
            },
            "braid_tf": {
                "1-是": 7,
                "0-否": 2
            },
            "braid_type": {
                "0-没有辫子": 2,
                "3-脏辫": 7
            },
            "braid_count": {
                "0-没有辫子": 2,
                "3-多个辫子": 7
            },
            "braid_position": {
                "2-低辫子": 2,
                "1-高辫子（如高马尾）": 5,
                "0-没有辫子": 2
            }
        },
        "1657.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "top_direction": {
                "6-向上（头发立起来）": 7,
                "0-向下": 2
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 2,
                "3-头顶短发": 7
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 3,
                "1-侧边短发": 6
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1680.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "6-向上（头发立起来）": 7,
                "0-向下": 2,
                "2-横向": 1
            },
            "top_length": {
                "0-光头": 4,
                "2-头顶板寸": 5
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "0-侧边板寸（铲青，能看到头皮）": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1694.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "top_direction": {
                "6-向上（头发立起来）": 1,
                "1-斜下": 5,
                "0-向下": 1,
                "7-向后梳头（长发向后梳，大背头，马尾）": 2,
                "5-37分": 5
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 3,
                "3-侧边中长发：遮住耳朵": 3,
                "4-侧边中长发：刚好到肩膀": 3
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "1-马尾": 2,
                "4-丸子（一个或者多个）": 7
            },
            "braid_count": {
                "1-单个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "3083.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "top_direction": {
                "1-斜下": 4,
                "0-向下": 1,
                "5-37分": 9
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1327.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "top_direction": {
                "6-向上（头发立起来）": 5,
                "7-向后梳头（长发向后梳，大背头，马尾）": 6
            },
            "top_length": {
                "3-头顶短发": 2,
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 6
            },
            "side_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 4,
                "3-侧边中长发：遮住耳朵": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 2,
                "1-侧边短发": 2
            },
            "braid_tf": {
                "1-是": 5,
                "0-否": 4
            },
            "braid_type": {
                "0-没有辫子": 4,
                "1-马尾": 2,
                "3-脏辫": 1,
                "4-丸子（一个或者多个）": 2
            },
            "braid_count": {
                "0-没有辫子": 4,
                "1-单个辫子": 5
            },
            "braid_position": {
                "0-没有辫子": 4,
                "1-高辫子（如高马尾）": 5
            }
        },
        "1333.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "0-向下": 9,
                "4-中分": 2
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 6,
                "3-侧边中长发：遮住耳朵": 2,
                "5-长发：披肩或者有头发耷在肩膀上": 1
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1332.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "top_direction": {
                "0-向下": 2,
                "1-斜下": 3,
                "5-37分": 7,
                "4-中分": 1
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 7,
                "3-侧边中长发：遮住耳朵": 2
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1326.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 3,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 6
            },
            "top_direction": {
                "0-向下": 7,
                "1-斜下": 1,
                "5-37分": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 6,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 3
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 9
            },
            "braid_tf": {
                "1-是": 2,
                "0-否": 7
            },
            "braid_type": {
                "0-没有辫子": 7,
                "3-脏辫": 2
            },
            "braid_count": {
                "0-没有辫子": 7,
                "3-多个辫子": 2
            },
            "braid_position": {
                "0-没有辫子": 7,
                "1-高辫子（如高马尾）": 2
            }
        },
        "3082.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "top_direction": {
                "1-斜下": 6,
                "0-向下": 1,
                "5-37分": 5
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 2,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 8
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "1-马尾": 2,
                "2-麻花": 7
            },
            "braid_count": {
                "2-两个辫子": 8,
                "1-单个辫子": 1
            },
            "braid_position": {
                "2-低辫子": 9,
                "1-高辫子（如高马尾）": 1
            }
        },
        "1695.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "top_direction": {
                "1-斜下": 4,
                "0-向下": 1,
                "5-37分": 8
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 3,
                "3-侧边中长发：遮住耳朵": 2,
                "5-长发：披肩或者有头发耷在肩膀上": 4
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "1-马尾": 2,
                "2-麻花": 7
            },
            "braid_count": {
                "1-单个辫子": 9
            },
            "braid_position": {
                "2-低辫子": 9,
                "1-高辫子（如高马尾）": 1
            }
        },
        "1681.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 3,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "top_direction": {
                "0-向下": 2,
                "1-斜下": 2,
                "4-中分": 8,
                "5-37分": 1
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 3,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 9
            },
            "braid_tf": {
                "1-是": 1,
                "0-否": 8
            },
            "braid_type": {
                "0-没有辫子": 8,
                "3-脏辫": 1
            },
            "braid_count": {
                "0-没有辫子": 8,
                "3-多个辫子": 1
            },
            "braid_position": {
                "0-没有辫子": 8,
                "1-高辫子（如高马尾）": 1
            }
        },
        "8699.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "top_direction": {
                "0-向下": 2,
                "1-斜下": 2,
                "4-中分": 9
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 4,
                "5-长发：披肩或者有头发耷在肩膀上": 5
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1656.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "top_direction": {
                "6-向上（头发立起来）": 2,
                "7-向后梳头（长发向后梳，大背头，马尾）": 6,
                "0-向下": 1
            },
            "top_length": {
                "3-头顶短发": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 1,
                "2-侧边中长发：到耳朵，大于短发 ": 4,
                "3-侧边中长发：遮住耳朵": 1,
                "1-侧边短发": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 2
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "1-马尾": 3,
                "4-丸子（一个或者多个）": 6
            },
            "braid_count": {
                "1-单个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "3041.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 3,
                "1-有波纹": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "top_direction": {
                "0-向下": 1,
                "1-斜下": 2,
                "4-中分": 9
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 2,
                "5-长发：披肩或者有头发耷在肩膀上": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3055.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 4
            },
            "top_direction": {
                "6-向上（头发立起来）": 8,
                "7-向后梳头（长发向后梳，大背头，马尾）": 2
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 5,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 4
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 4
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 5,
                "3-侧边中长发：遮住耳朵": 4
            },
            "braid_tf": {
                "1-是": 2,
                "0-否": 7
            },
            "braid_type": {
                "0-没有辫子": 7,
                "3-脏辫": 2
            },
            "braid_count": {
                "0-没有辫子": 7,
                "3-多个辫子": 2
            },
            "braid_position": {
                "0-没有辫子": 7,
                "1-高辫子（如高马尾）": 2
            }
        },
        "3069.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "0-向下": 2,
                "1-斜下": 2,
                "7-向后梳头（长发向后梳，大背头，马尾）": 1,
                "4-中分": 8
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 3,
                "3-侧边中长发：遮住耳朵": 2,
                "5-长发：披肩或者有头发耷在肩膀上": 2,
                "4-侧边中长发：刚好到肩膀": 2
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "4-丸子（一个或者多个）": 9
            },
            "braid_count": {
                "2-两个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "1722.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 5
            },
            "top_direction": {
                "3-斜上": 3,
                "6-向上（头发立起来）": 5,
                "7-向后梳头（长发向后梳，大背头，马尾）": 2
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 2,
                "3-头顶短发": 7
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "1-侧边短发": 2,
                "0-侧边板寸（铲青，能看到头皮）": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2940.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "top_direction": {
                "0-向下": 1,
                "1-斜下": 1,
                "5-37分": 9
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3109.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 8
            },
            "top_direction": {
                "0-向下": 2,
                "1-斜下": 4,
                "3-斜上": 1,
                "7-向后梳头（长发向后梳，大背头，马尾）": 1,
                "2-横向": 1
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 8
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "3-脏辫": 9
            },
            "braid_count": {
                "3-多个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 7,
                "2-低辫子": 2
            }
        },
        "2987.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "top_direction": {
                "0-向下": 1,
                "1-斜下": 1,
                "4-中分": 9
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 5,
                "3-侧边中长发：遮住耳朵": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 3
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2950.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "top_direction": {
                "1-斜下": 4,
                "0-向下": 5,
                "2-横向": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 3,
                "5-长发：披肩或者有头发耷在肩膀上": 6
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "8716.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "top_direction": {
                "1-斜下": 2,
                "0-向下": 1,
                "4-中分": 8
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "8702.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 2,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 7
            },
            "top_direction": {
                "0-向下": 3,
                "2-横向": 1,
                "1-斜下": 2,
                "3-斜上": 1,
                "5-37分": 5
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 8
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "1-是": 7,
                "0-否": 2
            },
            "braid_type": {
                "0-没有辫子": 2,
                "3-脏辫": 7
            },
            "braid_count": {
                "0-没有辫子": 2,
                "3-多个辫子": 7
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 6,
                "2-低辫子": 2,
                "0-没有辫子": 2
            }
        },
        "3079.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "6-向上（头发立起来）": 7,
                "3-斜上": 1,
                "7-向后梳头（长发向后梳，大背头，马尾）": 1
            },
            "top_length": {
                "3-头顶短发": 2,
                "4-头顶中等长度（够不到眉毛）": 5,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 2
            },
            "side_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 4,
                "3-侧边中长发：遮住耳朵": 2,
                "1-侧边短发": 3
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1685.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "top_direction": {
                "7-向后梳头（长发向后梳，大背头，马尾）": 6,
                "3-斜上": 1,
                "6-向上（头发立起来）": 2
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 2,
                "2-头顶板寸": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 6
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "side_length": {
                "0-侧边板寸（铲青，能看到头皮）": 1,
                "2-侧边中长发：到耳朵，大于短发 ": 3,
                "3-侧边中长发：遮住耳朵": 1,
                "1-侧边短发": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 3
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "3-脏辫": 4,
                "4-丸子（一个或者多个）": 5
            },
            "braid_count": {
                "3-多个辫子": 7,
                "1-单个辫子": 2
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "1691.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "top_direction": {
                "0-向下": 9,
                "5-37分": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 8
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 8,
                "4-侧边中长发：刚好到肩膀": 1
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1322.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "top_direction": {
                "2-横向": 1,
                "1-斜下": 4,
                "5-37分": 6
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 9
            },
            "braid_tf": {
                "1-是": 6,
                "0-否": 3
            },
            "braid_type": {
                "0-没有辫子": 3,
                "3-脏辫": 6
            },
            "braid_count": {
                "0-没有辫子": 3,
                "3-多个辫子": 6
            },
            "braid_position": {
                "0-没有辫子": 3,
                "1-高辫子（如高马尾）": 5,
                "2-低辫子": 1
            }
        },
        "1336.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 9
            },
            "top_direction": {
                "1-斜下": 4,
                "0-向下": 1,
                "2-横向": 1,
                "5-37分": 7
            },
            "top_length": {
                "3-头顶短发": 1,
                "4-头顶中等长度（够不到眉毛）": 5,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 3
            },
            "side_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 8
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "1-侧边短发": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1337.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 2,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 7
            },
            "top_direction": {
                "2-横向": 2,
                "0-向下": 1,
                "1-斜下": 2,
                "5-37分": 8
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 2,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 7
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 5,
                "4-侧边中长发：刚好到肩膀": 4
            },
            "braid_tf": {
                "1-是": 7,
                "0-否": 2
            },
            "braid_type": {
                "0-没有辫子": 2,
                "3-脏辫": 7
            },
            "braid_count": {
                "0-没有辫子": 2,
                "3-多个辫子": 7
            },
            "braid_position": {
                "2-低辫子": 2,
                "1-高辫子（如高马尾）": 5,
                "0-没有辫子": 2
            }
        },
        "2602.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "top_direction": {
                "6-向上（头发立起来）": 8,
                "7-向后梳头（长发向后梳，大背头，马尾）": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 3,
                "3-头顶短发": 6
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 5,
                "1-侧边短发": 4
            },
            "braid_tf": {
                "1-是": 1,
                "0-否": 8
            },
            "braid_type": {
                "0-没有辫子": 8,
                "3-脏辫": 1
            },
            "braid_count": {
                "0-没有辫子": 8,
                "3-多个辫子": 1
            },
            "braid_position": {
                "0-没有辫子": 8,
                "1-高辫子（如高马尾）": 1
            }
        },
        "1323.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 8,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "2-横向": 4,
                "3-斜上": 4,
                "6-向上（头发立起来）": 1,
                "1-斜下": 1,
                "5-37分": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 5,
                "3-头顶短发": 4
            },
            "side_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "1-侧边短发": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1690.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 4
            },
            "top_direction": {
                "6-向上（头发立起来）": 1,
                "7-向后梳头（长发向后梳，大背头，马尾）": 4,
                "0-向下": 1,
                "4-中分": 6
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "1-有波纹": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 4
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 7,
                "3-侧边中长发：遮住耳朵": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 1
            },
            "braid_tf": {
                "1-是": 7,
                "0-否": 2
            },
            "braid_type": {
                "0-没有辫子": 2,
                "3-脏辫": 2,
                "4-丸子（一个或者多个）": 5
            },
            "braid_count": {
                "0-没有辫子": 2,
                "2-两个辫子": 5,
                "3-多个辫子": 2
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 7,
                "0-没有辫子": 2
            }
        },
        "1684.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 8
            },
            "top_direction": {
                "6-向上（头发立起来）": 1,
                "3-斜上": 3,
                "7-向后梳头（长发向后梳，大背头，马尾）": 1,
                "1-斜下": 2,
                "5-37分": 2
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 2,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 7
            },
            "side_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 8
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 5,
                "3-侧边中长发：遮住耳朵": 2,
                "1-侧边短发": 2
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "8703.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "top_direction": {
                "6-向上（头发立起来）": 2,
                "7-向后梳头（长发向后梳，大背头，马尾）": 6,
                "0-向下": 1,
                "4-中分": 3
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "3-脏辫": 9
            },
            "braid_count": {
                "3-多个辫子": 8,
                "1-单个辫子": 1
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "2945.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "top_direction": {
                "1-斜下": 4,
                "4-中分": 8
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 4
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2947.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 8,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "1-斜下": 4,
                "4-中分": 8
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "1-有波纹": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 4,
                "3-侧边中长发：遮住耳朵": 2,
                "1-侧边短发": 3
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1725.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "2-横向": 4,
                "1-斜下": 2,
                "0-向下": 2,
                "3-斜上": 1
            },
            "top_length": {
                "1-谢顶/高发际线": 9
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "0-侧边板寸（铲青，能看到头皮）": 1,
                "1-侧边短发": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "8701.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "top_direction": {
                "1-斜下": 4,
                "4-中分": 9
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 4
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1719.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 3,
                "1-有波纹": 6
            },
            "top_direction": {
                "6-向上（头发立起来）": 9,
                "4-中分": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 4,
                "3-头顶短发": 5
            },
            "side_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "side_length": {
                "0-侧边板寸（铲青，能看到头皮）": 3,
                "1-侧边短发": 6
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1645.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 4
            },
            "top_direction": {
                "1-斜下": 5,
                "3-斜上": 1,
                "5-37分": 5
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 4
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "3-侧边中长发：遮住耳朵": 7
            },
            "braid_tf": {
                "1-是": 2,
                "0-否": 7
            },
            "braid_type": {
                "0-没有辫子": 7,
                "3-脏辫": 2
            },
            "braid_count": {
                "0-没有辫子": 7,
                "3-多个辫子": 2
            },
            "braid_position": {
                "0-没有辫子": 7,
                "1-高辫子（如高马尾）": 2
            }
        },
        "1679.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "top_direction": {
                "7-向后梳头（长发向后梳，大背头，马尾）": 8,
                "3-斜上": 1,
                "4-中分": 3
            },
            "top_length": {
                "3-头顶短发": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "3-脏辫": 9
            },
            "braid_count": {
                "3-多个辫子": 9
            },
            "braid_position": {
                "2-低辫子": 4,
                "1-高辫子（如高马尾）": 5
            }
        },
        "1692.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 5
            },
            "top_direction": {
                "1-斜下": 6,
                "5-37分": 5
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 8,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 3,
                "4-侧边中长发：刚好到肩膀": 6
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1686.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "top_direction": {
                "7-向后梳头（长发向后梳，大背头，马尾）": 6,
                "3-斜上": 2,
                "6-向上（头发立起来）": 1,
                "4-中分": 2
            },
            "top_length": {
                "3-头顶短发": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 8,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "3-侧边中长发：遮住耳朵": 5,
                "5-长发：披肩或者有头发耷在肩膀上": 3
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "3-脏辫": 8,
                "1-马尾": 1
            },
            "braid_count": {
                "3-多个辫子": 6,
                "1-单个辫子": 3
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "1335.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "1-斜下": 7,
                "5-37分": 6
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "3-侧边中长发：遮住耳朵": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1321.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 9
            },
            "top_direction": {
                "6-向上（头发立起来）": 1,
                "1-斜下": 3,
                "5-37分": 6
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 8,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1309.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "top_direction": {
                "0-向下": 9,
                "4-中分": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 8,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 1
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1320.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "top_direction": {
                "0-向下": 1,
                "1-斜下": 2,
                "4-中分": 8
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1334.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 8
            },
            "top_direction": {
                "2-横向": 3,
                "1-斜下": 4,
                "5-37分": 2
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 4,
                "3-头顶短发": 5
            },
            "side_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 5
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 3,
                "1-侧边短发": 6
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1687.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 3,
                "1-有波纹": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "1-斜下": 6,
                "0-向下": 1,
                "5-37分": 5
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9,
                "2-低辫子": 1
            }
        },
        "1693.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "6-向上（头发立起来）": 4,
                "7-向后梳头（长发向后梳，大背头，马尾）": 5,
                "1-斜下": 1
            },
            "top_length": {
                "3-头顶短发": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 6,
                "3-侧边中长发：遮住耳朵": 2,
                "5-长发：披肩或者有头发耷在肩膀上": 1
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "1-马尾": 1,
                "4-丸子（一个或者多个）": 8
            },
            "braid_count": {
                "1-单个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "1718.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "top_direction": {
                "1-斜下": 7,
                "5-37分": 5
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "3-侧边中长发：遮住耳朵": 7,
                "0-侧边板寸（铲青，能看到头皮）": 1
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1724.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "6-向上（头发立起来）": 7,
                "0-向下": 1,
                "7-向后梳头（长发向后梳，大背头，马尾）": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 3,
                "3-头顶短发": 6
            },
            "side_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "1-侧边短发": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "8700.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "top_direction": {
                "0-向下": 2,
                "1-斜下": 3,
                "4-中分": 9
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2935.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "1-斜下": 6,
                "5-37分": 5
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 2,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 7
            },
            "side_curly": {
                "1-有波纹": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1346.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 5
            },
            "top_direction": {
                "2-横向": 6,
                "1-斜下": 1,
                "3-斜上": 1,
                "5-37分": 2
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 5,
                "3-头顶短发": 4
            },
            "side_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "1-侧边短发": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2897.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "top_direction": {
                "0-向下": 3,
                "6-向上（头发立起来）": 1,
                "1-斜下": 1,
                "4-中分": 4
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 3,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 6
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "3-侧边中长发：遮住耳朵": 6,
                "1-侧边短发": 1
            },
            "braid_tf": {
                "1-是": 4,
                "0-否": 5
            },
            "braid_type": {
                "0-没有辫子": 5,
                "3-脏辫": 4
            },
            "braid_count": {
                "0-没有辫子": 5,
                "3-多个辫子": 4
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 4,
                "0-没有辫子": 5
            }
        },
        "2673.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "1-斜下": 2,
                "0-向下": 7,
                "4-中分": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 5,
                "3-侧边中长发：遮住耳朵": 3,
                "1-侧边短发": 1
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3035.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 4
            },
            "top_direction": {
                "7-向后梳头（长发向后梳，大背头，马尾）": 4,
                "1-斜下": 1,
                "4-中分": 4,
                "5-37分": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "1-马尾": 1,
                "2-麻花": 8
            },
            "braid_count": {
                "2-两个辫子": 9
            },
            "braid_position": {
                "2-低辫子": 9,
                "1-高辫子（如高马尾）": 2
            }
        },
        "2665.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 8,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "3-斜上": 4,
                "2-横向": 4,
                "1-斜下": 1,
                "5-37分": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 4,
                "3-头顶短发": 3,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 2
            },
            "side_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "1-侧边短发": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3037.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "top_direction": {
                "0-向下": 1,
                "1-斜下": 1,
                "4-中分": 8
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 7,
                "3-侧边中长发：遮住耳朵": 2
            },
            "braid_tf": {
                "1-是": 3,
                "0-否": 6
            },
            "braid_type": {
                "0-没有辫子": 6,
                "3-脏辫": 3
            },
            "braid_count": {
                "0-没有辫子": 6,
                "3-多个辫子": 3
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 3,
                "0-没有辫子": 6
            }
        },
        "2895.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "top_direction": {
                "6-向上（头发立起来）": 7,
                "7-向后梳头（长发向后梳，大背头，马尾）": 3
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 3,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 6
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "3-侧边中长发：遮住耳朵": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2659.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "0-向下": 2,
                "1-斜下": 1,
                "4-中分": 9
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 4,
                "3-侧边中长发：遮住耳朵": 4,
                "1-侧边短发": 1
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2658.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "top_direction": {
                "2-横向": 1,
                "6-向上（头发立起来）": 1,
                "1-斜下": 2,
                "5-37分": 5
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 6,
                "3-侧边中长发：遮住耳朵": 2,
                "1-侧边短发": 1
            },
            "braid_tf": {
                "1-是": 7,
                "0-否": 2
            },
            "braid_type": {
                "0-没有辫子": 2,
                "3-脏辫": 7
            },
            "braid_count": {
                "0-没有辫子": 2,
                "3-多个辫子": 7
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 5,
                "0-没有辫子": 2,
                "2-低辫子": 2
            }
        },
        "2937.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 5
            },
            "top_direction": {
                "7-向后梳头（长发向后梳，大背头，马尾）": 3,
                "3-斜上": 1,
                "4-中分": 8
            },
            "top_length": {
                "3-头顶短发": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "1-马尾": 1,
                "2-麻花": 8
            },
            "braid_count": {
                "2-两个辫子": 8,
                "1-单个辫子": 1
            },
            "braid_position": {
                "2-低辫子": 7,
                "1-高辫子（如高马尾）": 2,
                "0-没有辫子": 1
            }
        },
        "2923.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 8
            },
            "top_direction": {
                "3-斜上": 3,
                "6-向上（头发立起来）": 6,
                "5-37分": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 4,
                "3-头顶短发": 4,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 1
            },
            "side_curly": {
                "0-不卷曲": 3,
                "1-有波纹": 6
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "3-侧边中长发：遮住耳朵": 4,
                "4-侧边中长发：刚好到肩膀": 1,
                "1-侧边短发": 3
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3026.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "0-向下": 1,
                "1-斜下": 2,
                "5-37分": 8
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 8,
                "3-侧边中长发：遮住耳朵": 1
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1341.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "2-横向": 1,
                "0-向下": 1,
                "1-斜下": 3,
                "5-37分": 7,
                "4-中分": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 5,
                "3-侧边中长发：遮住耳朵": 2,
                "1-侧边短发": 2
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2674.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "1-斜下": 3,
                "0-向下": 1,
                "5-37分": 7,
                "4-中分": 1
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2660.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "top_direction": {
                "2-横向": 6,
                "3-斜上": 2,
                "5-37分": 4
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 4,
                "3-头顶短发": 5
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "1-侧边短发": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2661.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "1-斜下": 4,
                "5-37分": 7
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "4-侧边中长发：刚好到肩膀": 2,
                "3-侧边中长发：遮住耳朵": 6
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1340.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 7
            },
            "top_direction": {
                "6-向上（头发立起来）": 4,
                "3-斜上": 1,
                "7-向后梳头（长发向后梳，大背头，马尾）": 4
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 4,
                "3-头顶短发": 5
            },
            "side_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "side_length": {
                "1-侧边短发": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3027.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "1-斜下": 3,
                "7-向后梳头（长发向后梳，大背头，马尾）": 3,
                "4-中分": 7
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 8,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 5,
                "5-长发：披肩或者有头发耷在肩膀上": 4
            },
            "braid_tf": {
                "1-是": 7,
                "0-否": 2
            },
            "braid_type": {
                "0-没有辫子": 2,
                "1-马尾": 5,
                "4-丸子（一个或者多个）": 2
            },
            "braid_count": {
                "0-没有辫子": 2,
                "1-单个辫子": 7
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 7,
                "0-没有辫子": 2
            }
        },
        "3033.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "top_direction": {
                "2-横向": 5,
                "1-斜下": 1,
                "3-斜上": 1,
                "5-37分": 4
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 4,
                "3-头顶短发": 5
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "1-侧边短发": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "8748.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "top_direction": {
                "0-向下": 9,
                "4-中分": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 7,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 2
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 7,
                "3-侧边中长发：遮住耳朵": 2
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2932.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "top_direction": {
                "1-斜下": 2,
                "0-向下": 7,
                "4-中分": 1
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "4-侧边中长发：刚好到肩膀": 3,
                "3-侧边中长发：遮住耳朵": 5
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2930.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 5
            },
            "top_direction": {
                "1-斜下": 1,
                "0-向下": 8
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "3-头顶短发": 8
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "1-侧边短发": 1,
                "0-侧边板寸（铲青，能看到头皮）": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2926.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 3,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "0-向下": 7,
                "7-向后梳头（长发向后梳，大背头，马尾）": 2,
                "1-斜下": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 4,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 5
            },
            "side_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "3-侧边中长发：遮住耳朵": 7,
                "4-侧边中长发：刚好到肩膀": 1
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "1-马尾": 9
            },
            "braid_count": {
                "1-单个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "2924.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "top_direction": {
                "1-斜下": 5,
                "5-37分": 6
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 8,
                "4-侧边中长发：刚好到肩膀": 1
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3025.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "6-向上（头发立起来）": 3,
                "2-横向": 4,
                "0-向下": 2
            },
            "top_length": {
                "0-光头": 1,
                "2-头顶板寸": 6,
                "3-头顶短发": 2
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "1-侧边短发": 2,
                "0-侧边板寸（铲青，能看到头皮）": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2307.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "0-向下": 8,
                "6-向上（头发立起来）": 1,
                "7-向后梳头（长发向后梳，大背头，马尾）": 1
            },
            "top_length": {
                "2-头顶板寸": 1,
                "3-头顶短发": 8
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "0-侧边板寸（铲青，能看到头皮）": 1,
                "1-侧边短发": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1342.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 9
            },
            "top_direction": {
                "2-横向": 2,
                "1-斜下": 3,
                "0-向下": 2,
                "5-37分": 2
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 4,
                "3-头顶短发": 5
            },
            "side_curly": {
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 9
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 3,
                "1-侧边短发": 6
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "8752.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "0-向下": 9,
                "4-中分": 2
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 3,
                "5-长发：披肩或者有头发耷在肩膀上": 6
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3028.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "top_direction": {
                "7-向后梳头（长发向后梳，大背头，马尾）": 7,
                "6-向上（头发立起来）": 3
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 4
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 8
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "1-马尾": 3,
                "4-丸子（一个或者多个）": 6
            },
            "braid_count": {
                "1-单个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "3002.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "top_direction": {
                "0-向下": 8,
                "7-向后梳头（长发向后梳，大背头，马尾）": 2
            },
            "top_length": {
                "3-头顶短发": 1,
                "4-头顶中等长度（够不到眉毛）": 6,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 2
            },
            "side_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 3,
                "3-侧边中长发：遮住耳朵": 5,
                "4-侧边中长发：刚好到肩膀": 1
            },
            "braid_tf": {
                "1-是": 8,
                "0-否": 1
            },
            "braid_type": {
                "0-没有辫子": 1,
                "1-马尾": 2,
                "4-丸子（一个或者多个）": 6
            },
            "braid_count": {
                "0-没有辫子": 1,
                "1-单个辫子": 8
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 8,
                "0-没有辫子": 1
            }
        },
        "2650.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "7-向后梳头（长发向后梳，大背头，马尾）": 1,
                "0-向下": 1,
                "4-中分": 8
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 6,
                "3-侧边中长发：遮住耳朵": 3
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3003.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "top_direction": {
                "1-斜下": 5,
                "0-向下": 5
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 6,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 3
            },
            "side_curly": {
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 6,
                "3-侧边中长发：遮住耳朵": 3
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "8750.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "1-斜下": 3,
                "7-向后梳头（长发向后梳，大背头，马尾）": 3,
                "4-中分": 7
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 2,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 7
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "1-马尾": 9
            },
            "braid_count": {
                "1-单个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "8754.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "top_direction": {
                "6-向上（头发立起来）": 4,
                "0-向下": 5
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 2,
                "3-头顶短发": 6,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 1
            },
            "side_curly": {
                "0-不卷曲": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "side_length": {
                "0-侧边板寸（铲青，能看到头皮）": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2286.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "6-向上（头发立起来）": 6,
                "0-向下": 3
            },
            "top_length": {
                "0-光头": 4,
                "2-头顶板寸": 4,
                "3-头顶短发": 1
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "0-侧边板寸（铲青，能看到头皮）": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2641.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 6
            },
            "top_direction": {
                "6-向上（头发立起来）": 9
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 3,
                "3-头顶短发": 6
            },
            "side_curly": {
                "0-不卷曲": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 4
            },
            "side_length": {
                "1-侧边短发": 1,
                "0-侧边板寸（铲青，能看到头皮）": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2640.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "top_direction": {
                "3-斜上": 3,
                "6-向上（头发立起来）": 2,
                "7-向后梳头（长发向后梳，大背头，马尾）": 2,
                "1-斜下": 2,
                "5-37分": 3
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 7,
                "3-侧边中长发：遮住耳朵": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 1
            },
            "braid_tf": {
                "1-是": 3,
                "0-否": 6
            },
            "braid_type": {
                "0-没有辫子": 6,
                "3-脏辫": 3
            },
            "braid_count": {
                "0-没有辫子": 6,
                "3-多个辫子": 3
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 3,
                "0-没有辫子": 6,
                "2-低辫子": 1
            }
        },
        "8741.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 3,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "top_direction": {
                "0-向下": 7,
                "7-向后梳头（长发向后梳，大背头，马尾）": 1,
                "4-中分": 3
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 5,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 4
            },
            "side_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 6,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 3,
                "3-侧边中长发：遮住耳朵": 5,
                "5-长发：披肩或者有头发耷在肩膀上": 1
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "4-丸子（一个或者多个）": 8,
                "2-麻花": 1
            },
            "braid_count": {
                "2-两个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "3012.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 3,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "top_direction": {
                "1-斜下": 3,
                "7-向后梳头（长发向后梳，大背头，马尾）": 1,
                "4-中分": 8
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 4
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 8
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "4-丸子（一个或者多个）": 8,
                "2-麻花": 1
            },
            "braid_count": {
                "2-两个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "3010.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "top_direction": {
                "2-横向": 4,
                "6-向上（头发立起来）": 2,
                "3-斜上": 3,
                "5-37分": 1,
                "4-中分": 2
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 5,
                "3-头顶短发": 4
            },
            "side_curly": {
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 4,
                "3-侧边中长发：遮住耳朵": 1,
                "1-侧边短发": 4
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2642.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "top_direction": {
                "6-向上（头发立起来）": 8,
                "0-向下": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "2-头顶板寸": 1,
                "3-头顶短发": 7
            },
            "side_curly": {
                "0-不卷曲": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "side_length": {
                "0-侧边板寸（铲青，能看到头皮）": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2656.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "top_direction": {
                "2-横向": 2,
                "0-向下": 1,
                "1-斜下": 3,
                "3-斜上": 1,
                "5-37分": 4
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 3,
                "3-侧边中长发：遮住耳朵": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 5
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3011.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "top_direction": {
                "0-向下": 1,
                "1-斜下": 4,
                "5-37分": 6
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "8756.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 3,
                "1-有波纹": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "top_direction": {
                "0-向下": 1,
                "1-斜下": 2,
                "4-中分": 8
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "1-有波纹": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2290.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "6-向上（头发立起来）": 5,
                "0-向下": 4
            },
            "top_length": {
                "0-光头": 9
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 1,
                "0-侧边板寸（铲青，能看到头皮）": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "8742.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 9
            },
            "top_direction": {
                "1-斜下": 1,
                "0-向下": 8
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 7,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 2
            },
            "side_curly": {
                "1-有波纹": 9
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 4,
                "4-侧边中长发：刚好到肩膀": 1,
                "3-侧边中长发：遮住耳朵": 4
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2938.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 2,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 4
            },
            "top_direction": {
                "6-向上（头发立起来）": 6,
                "2-横向": 2,
                "0-向下": 1
            },
            "top_length": {
                "2-头顶板寸": 2,
                "3-头顶短发": 7
            },
            "side_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 2,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "side_length": {
                "0-侧边板寸（铲青，能看到头皮）": 3,
                "1-侧边短发": 6
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2977.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 3,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 6
            },
            "top_direction": {
                "6-向上（头发立起来）": 1,
                "2-横向": 2,
                "0-向下": 1,
                "1-斜下": 3,
                "3-斜上": 1,
                "5-37分": 4
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 2,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 7
            },
            "side_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 3,
                "3-侧边中长发：遮住耳朵": 6
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2988.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "top_direction": {
                "7-向后梳头（长发向后梳，大背头，马尾）": 1,
                "0-向下": 1,
                "4-中分": 8
            },
            "top_length": {
                "3-头顶短发": 2,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 7
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "3-侧边中长发：遮住耳朵": 2,
                "5-长发：披肩或者有头发耷在肩膀上": 6
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "1-马尾": 9
            },
            "braid_count": {
                "2-两个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "8719.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "top_direction": {
                "0-向下": 1,
                "1-斜下": 3,
                "5-37分": 5
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "1-是": 7,
                "0-否": 2
            },
            "braid_type": {
                "0-没有辫子": 2,
                "3-脏辫": 7
            },
            "braid_count": {
                "0-没有辫子": 2,
                "3-多个辫子": 7
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 6,
                "0-没有辫子": 2,
                "2-低辫子": 1
            }
        },
        "1701.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "top_direction": {
                "1-斜下": 4,
                "0-向下": 1,
                "5-37分": 6
            },
            "top_length": {
                "3-头顶短发": 1,
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 7
            },
            "side_curly": {
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 4,
                "3-侧边中长发：遮住耳朵": 5
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1729.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 3,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 6
            },
            "top_direction": {
                "6-向上（头发立起来）": 8,
                "0-向下": 2
            },
            "top_length": {
                "2-头顶板寸": 2,
                "3-头顶短发": 7
            },
            "side_curly": {
                "0-不卷曲": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "side_length": {
                "1-侧边短发": 1,
                "0-侧边板寸（铲青，能看到头皮）": 8
            },
            "braid_tf": {
                "1-是": 1,
                "0-否": 8
            },
            "braid_type": {
                "0-没有辫子": 8,
                "3-脏辫": 1
            },
            "braid_count": {
                "0-没有辫子": 8,
                "3-多个辫子": 1
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 1,
                "0-没有辫子": 8
            }
        },
        "1715.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "0-向下": 1,
                "4-中分": 8
            },
            "top_length": {
                "3-头顶短发": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 7,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 3,
                "5-长发：披肩或者有头发耷在肩膀上": 4,
                "0-侧边板寸（铲青，能看到头皮）": 2
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "1-马尾": 1,
                "2-麻花": 8
            },
            "braid_count": {
                "2-两个辫子": 8,
                "1-单个辫子": 1
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "1649.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "top_direction": {
                "3-斜上": 3,
                "2-横向": 5,
                "1-斜下": 1,
                "5-37分": 3
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 4,
                "3-头顶短发": 4,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 1
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "1-侧边短发": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1675.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "0-向下": 1,
                "1-斜下": 2,
                "4-中分": 8
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "1-有波纹": 8,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1661.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "1-斜下": 2,
                "0-向下": 7
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 5,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 4
            },
            "side_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 5
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 3,
                "1-侧边短发": 6
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1339.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 8,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "2-横向": 1,
                "1-斜下": 4,
                "5-37分": 5
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 8,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 4,
                "3-侧边中长发：遮住耳朵": 5
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1311.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "top_direction": {
                "1-斜下": 4,
                "5-37分": 9
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 2,
                "3-侧边中长发：遮住耳朵": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1305.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "top_direction": {
                "2-横向": 5,
                "1-斜下": 1,
                "3-斜上": 1,
                "5-37分": 7
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 5,
                "3-头顶短发": 3,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 1
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 3,
                "1-侧边短发": 6
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1338.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "top_direction": {
                "1-斜下": 3,
                "0-向下": 4,
                "6-向上（头发立起来）": 2
            },
            "top_length": {
                "3-头顶短发": 2,
                "4-头顶中等长度（够不到眉毛）": 6,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 1
            },
            "side_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 5,
                "1-侧边短发": 4
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1304.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "1-斜下": 3,
                "0-向下": 1,
                "4-中分": 9
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 2,
                "5-长发：披肩或者有头发耷在肩膀上": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3063.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "top_direction": {
                "1-斜下": 6,
                "5-37分": 6
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 2,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 7
            },
            "side_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 4,
                "5-长发：披肩或者有头发耷在肩膀上": 5
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1674.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "top_direction": {
                "0-向下": 1,
                "1-斜下": 2,
                "4-中分": 8
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1648.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 8,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "2-横向": 1,
                "0-向下": 1,
                "6-向上（头发立起来）": 1,
                "1-斜下": 2,
                "5-37分": 6
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 2,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 7
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 8,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 9
            },
            "braid_tf": {
                "1-是": 6,
                "0-否": 3
            },
            "braid_type": {
                "0-没有辫子": 3,
                "3-脏辫": 6
            },
            "braid_count": {
                "0-没有辫子": 3,
                "3-多个辫子": 6
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 5,
                "0-没有辫子": 3,
                "2-低辫子": 2
            }
        },
        "1714.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 8,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "1-斜下": 1,
                "0-向下": 7,
                "4-中分": 2
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 5,
                "3-头顶短发": 3,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 1
            },
            "side_curly": {
                "0-不卷曲": 5,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 4
            },
            "side_length": {
                "1-侧边短发": 1,
                "0-侧边板寸（铲青，能看到头皮）": 8
            },
            "braid_tf": {
                "1-是": 8,
                "0-否": 1
            },
            "braid_type": {
                "0-没有辫子": 1,
                "3-脏辫": 8
            },
            "braid_count": {
                "0-没有辫子": 1,
                "3-多个辫子": 8
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 6,
                "2-低辫子": 2,
                "0-没有辫子": 1
            }
        },
        "3103.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "top_direction": {
                "0-向下": 1,
                "1-斜下": 2,
                "4-中分": 8
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 2,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 7
            },
            "side_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "4-侧边中长发：刚好到肩膀": 2,
                "3-侧边中长发：遮住耳朵": 5
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "8724.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "1-斜下": 7,
                "7-向后梳头（长发向后梳，大背头，马尾）": 3,
                "2-横向": 1,
                "0-向下": 1
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "1-是": 7,
                "0-否": 2
            },
            "braid_type": {
                "0-没有辫子": 2,
                "1-马尾": 5,
                "2-麻花": 2
            },
            "braid_count": {
                "0-没有辫子": 2,
                "1-单个辫子": 7
            },
            "braid_position": {
                "2-低辫子": 5,
                "1-高辫子（如高马尾）": 2,
                "0-没有辫子": 2
            }
        },
        "1700.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "top_direction": {
                "6-向上（头发立起来）": 9
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 3,
                "3-头顶短发": 6
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "1-侧边短发": 1,
                "0-侧边板寸（铲青，能看到头皮）": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2989.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "top_direction": {
                "0-向下": 9,
                "4-中分": 2
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2948.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 3,
                "1-有波纹": 6
            },
            "top_direction": {
                "2-横向": 1,
                "0-向下": 1,
                "1-斜下": 2,
                "3-斜上": 1,
                "5-37分": 6
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 8
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 6,
                "3-侧边中长发：遮住耳朵": 3
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1716.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 5
            },
            "top_direction": {
                "6-向上（头发立起来）": 4,
                "7-向后梳头（长发向后梳，大背头，马尾）": 5
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 2,
                "3-头顶短发": 2,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 5
            },
            "side_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "0-侧边板寸（铲青，能看到头皮）": 8
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "3-脏辫": 1,
                "1-马尾": 7,
                "4-丸子（一个或者多个）": 1
            },
            "braid_count": {
                "1-单个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "1702.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "top_direction": {
                "2-横向": 5,
                "3-斜上": 1,
                "6-向上（头发立起来）": 1,
                "1-斜下": 1,
                "5-37分": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 3,
                "3-头顶短发": 6
            },
            "side_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 3,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "0-侧边板寸（铲青，能看到头皮）": 1,
                "1-侧边短发": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1676.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "top_direction": {
                "6-向上（头发立起来）": 3,
                "7-向后梳头（长发向后梳，大背头，马尾）": 7
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 8
            },
            "braid_tf": {
                "1-是": 3,
                "0-否": 6
            },
            "braid_type": {
                "0-没有辫子": 6,
                "1-马尾": 1,
                "3-脏辫": 2
            },
            "braid_count": {
                "0-没有辫子": 6,
                "3-多个辫子": 1,
                "1-单个辫子": 2
            },
            "braid_position": {
                "0-没有辫子": 6,
                "1-高辫子（如高马尾）": 3
            }
        },
        "1689.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "top_direction": {
                "0-向下": 2,
                "1-斜下": 1,
                "4-中分": 8
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 4,
                "3-侧边中长发：遮住耳朵": 5
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1306.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 5
            },
            "top_direction": {
                "6-向上（头发立起来）": 9
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 4,
                "3-头顶短发": 5
            },
            "side_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 4
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "1-侧边短发": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1312.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "top_direction": {
                "1-斜下": 5,
                "0-向下": 1,
                "5-37分": 8
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 2,
                "3-侧边中长发：遮住耳朵": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1313.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "0-向下": 9,
                "4-中分": 2
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 6,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 3
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 3,
                "5-长发：披肩或者有头发耷在肩膀上": 6
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1307.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "0-向下": 1,
                "1-斜下": 2,
                "4-中分": 8
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1688.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 3,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 6
            },
            "top_direction": {
                "6-向上（头发立起来）": 2,
                "0-向下": 1,
                "1-斜下": 1,
                "4-中分": 6
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 4,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 5
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 3,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 6
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 6,
                "3-侧边中长发：遮住耳朵": 2,
                "5-长发：披肩或者有头发耷在肩膀上": 1
            },
            "braid_tf": {
                "1-是": 1,
                "0-否": 8
            },
            "braid_type": {
                "0-没有辫子": 8,
                "3-脏辫": 1
            },
            "braid_count": {
                "0-没有辫子": 8,
                "3-多个辫子": 1
            },
            "braid_position": {
                "0-没有辫子": 8,
                "1-高辫子（如高马尾）": 1
            }
        },
        "1677.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "top_direction": {
                "3-斜上": 1,
                "7-向后梳头（长发向后梳，大背头，马尾）": 8
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "3-头顶短发": 2,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 6
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "side_length": {
                "0-侧边板寸（铲青，能看到头皮）": 1,
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "3-侧边中长发：遮住耳朵": 1,
                "1-侧边短发": 2,
                "5-长发：披肩或者有头发耷在肩膀上": 3
            },
            "braid_tf": {
                "1-是": 8,
                "0-否": 1
            },
            "braid_type": {
                "0-没有辫子": 1,
                "3-脏辫": 8
            },
            "braid_count": {
                "0-没有辫子": 1,
                "3-多个辫子": 7,
                "1-单个辫子": 1
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 6,
                "0-没有辫子": 1,
                "2-低辫子": 2
            }
        },
        "1703.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "top_direction": {
                "0-向下": 2,
                "1-斜下": 2,
                "5-37分": 5
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "1-是": 7,
                "0-否": 2
            },
            "braid_type": {
                "0-没有辫子": 2,
                "3-脏辫": 7
            },
            "braid_count": {
                "0-没有辫子": 2,
                "3-多个辫子": 7
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 6,
                "0-没有辫子": 2,
                "2-低辫子": 2
            }
        },
        "1717.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 4
            },
            "top_direction": {
                "1-斜下": 6,
                "2-横向": 1,
                "7-向后梳头（长发向后梳，大背头，马尾）": 1,
                "5-37分": 2
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "4-侧边中长发：刚好到肩膀": 3,
                "5-长发：披肩或者有头发耷在肩膀上": 4,
                "1-侧边短发": 1
            },
            "braid_tf": {
                "1-是": 7,
                "0-否": 2
            },
            "braid_type": {
                "0-没有辫子": 2,
                "1-马尾": 7
            },
            "braid_count": {
                "0-没有辫子": 2,
                "1-单个辫子": 7
            },
            "braid_position": {
                "2-低辫子": 6,
                "1-高辫子（如高马尾）": 1,
                "0-没有辫子": 2
            }
        },
        "2975.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 9
            },
            "top_direction": {
                "0-向下": 6,
                "3-斜上": 1,
                "1-斜下": 2
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 5,
                "3-头顶短发": 4
            },
            "side_curly": {
                "0-不卷曲": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "0-侧边板寸（铲青，能看到头皮）": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2949.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "1-斜下": 5,
                "0-向下": 3,
                "5-37分": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 8,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 1
            },
            "side_curly": {
                "1-有波纹": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 5
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2971.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "top_direction": {
                "6-向上（头发立起来）": 2,
                "1-斜下": 2,
                "3-斜上": 2,
                "5-37分": 3
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 2,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 7
            },
            "side_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 4,
                "3-侧边中长发：遮住耳朵": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 4
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1713.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 3,
                "1-有波纹": 6
            },
            "top_direction": {
                "3-斜上": 4,
                "2-横向": 3,
                "1-斜下": 2,
                "6-向上（头发立起来）": 1,
                "7-向后梳头（长发向后梳，大背头，马尾）": 1,
                "5-37分": 1
            },
            "top_length": {
                "3-头顶短发": 2,
                "4-头顶中等长度（够不到眉毛）": 3,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 4
            },
            "side_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "0-侧边板寸（铲青，能看到头皮）": 1,
                "1-侧边短发": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "8723.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 4
            },
            "top_direction": {
                "0-向下": 9,
                "4-中分": 2
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 2,
                "5-长发：披肩或者有头发耷在肩膀上": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "8737.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "top_direction": {
                "1-斜下": 3,
                "0-向下": 1,
                "4-中分": 9
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 4,
                "4-侧边中长发：刚好到肩膀": 5
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1707.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 3
            },
            "top_direction": {
                "1-斜下": 2,
                "0-向下": 1,
                "4-中分": 7
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3070.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "top_direction": {
                "0-向下": 6,
                "1-斜下": 2,
                "6-向上（头发立起来）": 1,
                "4-中分": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 3,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 6
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 8,
                "4-侧边中长发：刚好到肩膀": 1
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "3-脏辫": 8,
                "1-马尾": 1
            },
            "braid_count": {
                "2-两个辫子": 1,
                "3-多个辫子": 8
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 8,
                "2-低辫子": 2
            }
        },
        "1673.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "top_direction": {
                "7-向后梳头（长发向后梳，大背头，马尾）": 8,
                "6-向上（头发立起来）": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 7
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 4,
                "5-长发：披肩或者有头发耷在肩膀上": 1,
                "4-侧边中长发：刚好到肩膀": 4
            },
            "braid_tf": {
                "1-是": 5,
                "0-否": 4
            },
            "braid_type": {
                "0-没有辫子": 4,
                "1-马尾": 4,
                "3-脏辫": 1
            },
            "braid_count": {
                "0-没有辫子": 4,
                "3-多个辫子": 1,
                "1-单个辫子": 4
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 3,
                "0-没有辫子": 4,
                "2-低辫子": 2
            }
        },
        "1698.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 8
            },
            "top_direction": {
                "6-向上（头发立起来）": 7,
                "0-向下": 3,
                "1-斜下": 1
            },
            "top_length": {
                "3-头顶短发": 4,
                "4-头顶中等长度（够不到眉毛）": 4,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 1
            },
            "side_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 3,
                "1-侧边短发": 6
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1303.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "6-向上（头发立起来）": 5,
                "2-横向": 1,
                "0-向下": 3
            },
            "top_length": {
                "0-光头": 1,
                "2-头顶板寸": 4,
                "3-头顶短发": 4
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "1-侧边短发": 6,
                "0-侧边板寸（铲青，能看到头皮）": 3
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1317.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "1-斜下": 5,
                "5-37分": 8
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 8,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 6,
                "3-侧边中长发：遮住耳朵": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 2
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1316.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "1-斜下": 6,
                "0-向下": 2,
                "5-37分": 3
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 6,
                "4-侧边中长发：刚好到肩膀": 3
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1302.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 4
            },
            "top_direction": {
                "3-斜上": 3,
                "7-向后梳头（长发向后梳，大背头，马尾）": 4,
                "1-斜下": 1,
                "6-向上（头发立起来）": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 4,
                "3-头顶短发": 3,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 2
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "1-侧边短发": 1,
                "0-侧边板寸（铲青，能看到头皮）": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1699.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "2-横向": 5,
                "1-斜下": 2,
                "3-斜上": 1,
                "5-37分": 4
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 3,
                "3-头顶短发": 4,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 2
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "1-侧边短发": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3065.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "1-斜下": 1,
                "4-中分": 9
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 2
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 6,
                "4-侧边中长发：刚好到肩膀": 3
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1672.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "top_direction": {
                "0-向下": 1,
                "1-斜下": 1,
                "4-中分": 8
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 5,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 6,
                "4-侧边中长发：刚好到肩膀": 3
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1666.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 3,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 6
            },
            "top_direction": {
                "6-向上（头发立起来）": 9
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 3,
                "3-头顶短发": 6
            },
            "side_curly": {
                "0-不卷曲": 7,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "1-侧边短发": 1,
                "0-侧边板寸（铲青，能看到头皮）": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3071.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "1-斜下": 3,
                "0-向下": 2,
                "4-中分": 7
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 8,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "3-脏辫": 8,
                "2-麻花": 1
            },
            "braid_count": {
                "3-多个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 8,
                "2-低辫子": 2
            }
        },
        "8722.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "top_direction": {
                "1-斜下": 3,
                "0-向下": 1,
                "4-中分": 8
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 6,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 3
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 4,
                "3-侧边中长发：遮住耳朵": 2,
                "5-长发：披肩或者有头发耷在肩膀上": 3
            },
            "braid_tf": {
                "1-是": 6,
                "0-否": 3
            },
            "braid_type": {
                "0-没有辫子": 3,
                "3-脏辫": 6
            },
            "braid_count": {
                "0-没有辫子": 3,
                "3-多个辫子": 6
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 4,
                "2-低辫子": 2,
                "0-没有辫子": 3
            }
        },
        "1706.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "1-斜下": 5,
                "0-向下": 2,
                "5-37分": 4
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 8
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "1-马尾": 9
            },
            "braid_count": {
                "1-单个辫子": 9
            },
            "braid_position": {
                "2-低辫子": 9
            }
        },
        "1712.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "top_direction": {
                "2-横向": 6,
                "0-向下": 1,
                "3-斜上": 1,
                "5-37分": 3
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 2,
                "3-头顶短发": 7
            },
            "side_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "side_length": {
                "1-侧边短发": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3105.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "top_direction": {
                "1-斜下": 3,
                "0-向下": 1,
                "4-中分": 8
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 3,
                "3-侧边中长发：遮住耳朵": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 5
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1704.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "0-向下": 1,
                "4-中分": 8
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2970.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "top_direction": {
                "0-向下": 9
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 6,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 3
            },
            "side_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 5,
                "5-长发：披肩或者有头发耷在肩膀上": 4
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1710.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 5,
                "1-有波纹": 4
            },
            "top_direction": {
                "1-斜下": 6,
                "6-向上（头发立起来）": 1,
                "3-斜上": 1,
                "5-37分": 1
            },
            "top_length": {
                "3-头顶短发": 1,
                "4-头顶中等长度（够不到眉毛）": 2,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 6
            },
            "side_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "3-侧边中长发：遮住耳朵": 4,
                "0-侧边板寸（铲青，能看到头皮）": 3
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1670.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "1-斜下": 7,
                "2-横向": 1,
                "0-向下": 1,
                "5-37分": 3
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 6,
                "3-头顶短发": 2,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 1
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "1-侧边短发": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3073.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "1-斜下": 3,
                "0-向下": 1,
                "4-中分": 8
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "3-侧边中长发：遮住耳朵": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 5,
                "4-侧边中长发：刚好到肩膀": 3
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "1-马尾": 9
            },
            "braid_count": {
                "2-两个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "1658.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 8,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "6-向上（头发立起来）": 9
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 4,
                "3-头顶短发": 5
            },
            "side_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 4,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "1-侧边短发": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1314.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 9
            },
            "top_direction": {
                "2-横向": 1,
                "0-向下": 1,
                "1-斜下": 1,
                "5-37分": 8
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1300.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "top_direction": {
                "0-向下": 2,
                "1-斜下": 2,
                "4-中分": 5
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "1-有波纹": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 3,
                "5-长发：披肩或者有头发耷在肩膀上": 6
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1329.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 4,
                "1-有波纹": 5
            },
            "top_direction": {
                "1-斜下": 5,
                "0-向下": 1,
                "5-37分": 5
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 8
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "3-侧边中长发：遮住耳朵": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1315.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "top_direction": {
                "3-斜上": 1,
                "7-向后梳头（长发向后梳，大背头，马尾）": 3,
                "6-向上（头发立起来）": 1,
                "1-斜下": 2,
                "5-37分": 2
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 1,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 8
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 2,
                "5-长发：披肩或者有头发耷在肩膀上": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1301.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "1-有波纹": 7,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "3-斜上": 2,
                "6-向上（头发立起来）": 7,
                "5-37分": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 5,
                "3-头顶短发": 4
            },
            "side_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 2,
                "1-侧边短发": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "3072.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 8
            },
            "top_direction": {
                "7-向后梳头（长发向后梳，大背头，马尾）": 7,
                "0-向下": 1,
                "4-中分": 2
            },
            "top_length": {
                "3-头顶短发": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "3-脏辫": 7,
                "1-马尾": 2
            },
            "braid_count": {
                "3-多个辫子": 7,
                "1-单个辫子": 2
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9,
                "2-低辫子": 1
            }
        },
        "1671.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "top_direction": {
                "0-向下": 1,
                "1-斜下": 2,
                "4-中分": 8
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 2,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 7
            },
            "side_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 2,
                "3-侧边中长发：遮住耳朵": 7
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "2542.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 1,
                "3-脏辫卷（数不清楚的弯弯曲曲）": 8
            },
            "top_direction": {
                "0-向下": 2,
                "1-斜下": 2,
                "5-37分": 5
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "3-脏辫卷（数不清楚的弯弯曲曲）": 9
            },
            "side_length": {
                "5-长发：披肩或者有头发耷在肩膀上": 9
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "3-脏辫": 9
            },
            "braid_count": {
                "3-多个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 7,
                "2-低辫子": 3,
                "0-没有辫子": 1
            }
        },
        "1711.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 2,
                "1-有波纹": 7
            },
            "top_direction": {
                "3-斜上": 3,
                "1-斜下": 1,
                "6-向上（头发立起来）": 2,
                "2-横向": 2,
                "7-向后梳头（长发向后梳，大背头，马尾）": 1
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 4,
                "3-头顶短发": 5
            },
            "side_curly": {
                "0-不卷曲": 7,
                "1-有波纹": 2
            },
            "side_length": {
                "2-侧边中长发：到耳朵，大于短发 ": 1,
                "1-侧边短发": 8
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        },
        "1705.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 6,
                "1-有波纹": 2,
                "2-卷曲（每个弯是一个半圆，或者圆圈）": 1
            },
            "top_direction": {
                "7-向后梳头（长发向后梳，大背头，马尾）": 9
            },
            "top_length": {
                "4-头顶中等长度（够不到眉毛）": 1,
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 8
            },
            "side_curly": {
                "0-不卷曲": 3,
                "1-有波纹": 6
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 1,
                "5-长发：披肩或者有头发耷在肩膀上": 8
            },
            "braid_tf": {
                "1-是": 9
            },
            "braid_type": {
                "1-马尾": 9
            },
            "braid_count": {
                "1-单个辫子": 9
            },
            "braid_position": {
                "1-高辫子（如高马尾）": 9
            }
        },
        "8721.png": {
            "blur": {
                "0-不模糊": 9
            },
            "head_occlusion": {
                "0-无遮挡": 6,
                "0-无多人": 3
            },
            "mutiperson": {
                "0-无多人": 9
            },
            "top_curly": {
                "0-不卷曲": 8,
                "1-有波纹": 1
            },
            "top_direction": {
                "0-向下": 1,
                "1-斜下": 2,
                "4-中分": 8
            },
            "top_length": {
                "5-头顶长发（遮住眉毛/可以够得到眉毛）": 9
            },
            "side_curly": {
                "0-不卷曲": 9
            },
            "side_length": {
                "4-侧边中长发：刚好到肩膀": 4,
                "3-侧边中长发：遮住耳朵": 5
            },
            "braid_tf": {
                "0-否": 9
            },
            "braid_type": {
                "0-没有辫子": 9
            },
            "braid_count": {
                "0-没有辫子": 9
            },
            "braid_position": {
                "0-没有辫子": 9
            }
        }
    }

    var match_score = {}
    // Loop through object
    for (var region in selected_dict) {
        var region_dict = selected_dict[region];
        for (var attribute in region_dict) {
            var attr = parseInt(region_dict[attribute].replace('option',''));

            var attri_mapped_name = mapper[region] + "_" + mapper[attribute];

            for (var sample_i in asset_label){
                if (!match_score.hasOwnProperty(sample_i)){
                    match_score[sample_i] = 0;
                }
                
                var sample_label = asset_label[sample_i][attri_mapped_name];

                // Deal with discrete attributes
                if (attri_mapped_name in distance_score_type){
                    //  Show max value key in sample_label
                    var max_key = Object.keys(sample_label).reduce(function(a, b){ return sample_label[a] > sample_label[b] ? a : b });
                    max_key = parseInt(max_key.match(/\d+/)[0])+1 // asset is using option 0+, interface is using option 1+
                    
                    if (max_key != attr){
                        match_score[sample_i] += distance_score_type[attri_mapped_name];
                    }
                    a=1
                }
                // Deal with continuous attributes 
                else if (attri_mapped_name in distance_score_linear){
                    var total   = 0
                    var counter = 0
                    for (var key in sample_label){
                        total += sample_label[key] * parseInt(key.split('-')[0]);
                        counter += sample_label[key]
                    }
                    var avarage_score = total / counter;
                    match_score[sample_i] += Math.abs(avarage_score - attr) * distance_score_linear[attri_mapped_name];
                    a=1
                }
                
                
            }   
        }
    }

    // sort match_score by value return a dict
    // var sorted_match_score = Object.keys(match_score).sort(function(a,b){return match_score[a]-match_score[b]})
    var dict = match_score
    var url_root = 'https://minghaouserstudy.s3.amazonaws.com/HITL_navi/bitmoji_asset/'
    var items = Object.keys(dict).map(function(key) {
        return [url_root+key, dict[key]];
        });
    items.sort(function(first, second) {
        return  first[1]- second[1] ;
        });
    var match_list = items.slice(0, 5)
        
    //  # Mike this part
    // const match_list = ['url1','url2','url3']
    return match_list
}


const all_select = {
    'Top and front side' : {
      'Length': 'option1',
      'Curl Level': 'option2',
      'Direction': 'option3',
    },
    'Side': {
        'Length': 'option1',
        'Curl Level': 'option2',
    },
    'Braid': {
      'Count': 'option3',
      'Position': 'option1',
    },
   }
    
const now_select = {
    'Braid': {
        'Count': 'option3',
        'Position': 'option1',
    }
}

function translation_4_search(){

    
}

var a = search(now_select)

var b =1